TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_КонтрольЗаполненияВнешнихПроб/гкс_КонтрольЗаполненияВнешнихПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_КонтрольЗаполненияВнешнихПроб</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.гкс_ТипыОбъектовWarehouse</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВнешняяПроба</name>
    <type>
      <types>DocumentRef.гкс_ВнешняяПроба</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектWarehouse</name>
    <type>
      <types>DefinedType.гкс_WarehouseСправочники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СоответствиеОбъектовWarehouse/гкс_СоответствиеОбъектовWarehouse.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СоответствиеОбъектовWarehouse</name>
  <resources>
    <name>СсылкаИБ</name>
    <type>
      <types>DefinedType.гкс_WarehouseСинхронизируемыеСсылки</types>
    </type>
  </resources>
  <dimensions>
    <name>СсылкаWarehouse</name>
    <type>
      <types>DefinedType.гкс_WarehouseСправочники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_КонтрольЗаполненияВнешнихПроб/Forms/ФормаСопоставления/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокСоответствияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.СписокСоответствия.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		
		// Заполнение ключевых полей для новой записи
		ИзмеренияРегистраСведений  = Новый Структура("СсылкаWarehouse", ТекущиеДанные.ОбъектWarehouse);
		
		Если ЗначениеЗаполнено(ТекущиеДанные.СсылкаИБ) Тогда
			// Формируем массив для ключа записи
			КлючРегистраСведений = Новый Массив;
			КлючРегистраСведений.Добавить(ИзмеренияРегистраСведений);
			
			// Создаем ключ записи регистра
			КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.гкс_СоответствиеОбъектовWarehouse", КлючРегистраСведений);
				
			ПараметрыОткрытияФормы = Новый Структура("Ключ", КлючЗаписи); 
		
		Иначе
			ПараметрыОткрытияФормы = Новый Структура("ЗначенияЗаполнения", ИзмеренияРегистраСведений);
			
		КонецЕсли;	
			
		// Открываем форму записи регистра
		ОписаниеОповещенияПослеВвода = Новый ОписаниеОповещения(
			"ПослеЗакрытияФормыУстановкиСоответствия", ЭтотОбъект);
		
		ОткрытьФорму("РегистрСведений.гкс_СоответствиеОбъектовWarehouse.ФормаЗаписи", ПараметрыОткрытияФормы,,,,,
				ОписаниеОповещенияПослеВвода, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс)	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьПроблемныеПробы(Команда)
	
	ДлительнаяОперация = ОбработатьПроблемныеПробыНаСервере();
	Если ДлительнаяОперация <> Неопределено Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеОбработкиДанных", ЭтотОбъект);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ОписаниеПараметра - Структура
//  ДополнительныеПараметры - см. ДополнительныеПараметрыДобавленияРеквизитов 
// 
&НаКлиенте
Процедура ПослеЗакрытияФормыУстановкиСоответствия(ОписаниеПараметра, ДополнительныеПараметры) Экспорт
	
	Элементы.СписокСоответствия.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОбработкиДанных(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если Результат.Статус = "Ошибка" Тогда	
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Произошла ошибка при обработке %1 %2'"), 
			Символы.ПС, Результат.КраткоеПредставлениеОшибки);
			
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
	Иначе		
		ТекстСообщения = НСтр("ru = 'Обработка входящих данных завершена'");		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Элементы.СписокСоответствия.Обновить();	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ОбработатьПроблемныеПробыНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();	 
		
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
			"гкс_ИнтеграцияWarehouse.ОбработатьПроблемныеВнешниеПробы");	
КонецФункции

#КонецОбласти
